src/org/installation.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-07-13 Fri 03:35 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Installation</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Naoya Yamashita" />
</head>
<body>
<div id="content">
<h1 class="title">Installation</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgbbee1b6">1. Installation</a>
<ul>
<li><a href="#orgb62fc8e">1.1. Using Emacs packaging system</a></li>
<li><a href="#orgd0e70c1">1.2. Downloading Org as an archive</a></li>
<li><a href="#orge5f4072">1.3. Using Org’s git repository</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgbbee1b6" class="outline-2">
<h2 id="orgbbee1b6"><span class="section-number-2">1</span> Installation</h2>
<div class="outline-text-2" id="text-1">
<p>
Org is part of recent distributions of GNU Emacs, so you normally don’t need to install it. If, for one reason or another, you want to install Org on top of this pre-packaged version, there are three ways to do it:
</p>

<ul class="org-ul">
<li>By using Emacs package system.</li>
<li>By downloading Org as an archive.</li>
<li>By using Org’s git repository.</li>
</ul>

<p>
We <b>strongly recommend</b> to stick to a single installation method.
</p>
</div>

<div id="outline-container-orgb62fc8e" class="outline-3">
<h3 id="orgb62fc8e"><span class="section-number-3">1.1</span> Using Emacs packaging system</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Recent Emacs distributions include a packaging system which lets you install Elisp libraries. You can install Org with M-x package-install RET org.
</p>

<p>
<b>Important</b> : you need to do this in a session where no .org file has been visited, i.e., where no Org built-in function have been loaded. Otherwise autoload Org functions will mess up the installation.
</p>

<p>
Then, to make sure your Org configuration is taken into account, initialize the package system with (package-initialize) in your Emacs init file before setting any Org option. If you want to use Org’s package repository, check out the Org ELPA page.
</p>
</div>
</div>

<div id="outline-container-orgd0e70c1" class="outline-3">
<h3 id="orgd0e70c1"><span class="section-number-3">1.2</span> Downloading Org as an archive</h3>
<div class="outline-text-3" id="text-1-2">
<p>
You can download Org latest release from Org’s website. In this case, make sure you set the load-path correctly in your Emacs init file:
</p>

<p>
(add-to-list 'load-path "~/path/to/orgdir/lisp")
The downloaded archive contains contributed libraries that are not included in Emacs. If you want to use them, add the contrib directory to your load-path:
</p>

<p>
(add-to-list 'load-path "~/path/to/orgdir/contrib/lisp" t)
Optionally, you can compile the files and/or install them in your system. Run make help to list compilation and installation options.
</p>
</div>
</div>

<div id="outline-container-orge5f4072" class="outline-3">
<h3 id="orge5f4072"><span class="section-number-3">1.3</span> Using Org’s git repository</h3>
<div class="outline-text-3" id="text-1-3">
<p>
You can clone Org’s repository and install Org like this:
</p>
<div class="org-src-container">
<pre class="src src-bash">$ cd ~/src/
$ git clone https://code.orgmode.org/bzg/org-mode.git
$ cd org-mode/
$ make autoloads
</pre>
</div>
<p>
Note that in this case, make autoloads is mandatory: it defines Org’s version in org-version.el and Org’s autoloads in org-loaddefs.el.
</p>

<p>
Remember to add the correct load-path as described in the method above.
</p>

<p>
You can also compile with make, generate the documentation with make doc, create a local configuration with make config and install Org with make install. Please run make help to get the list of compilation/installation options.
</p>

<p>
For more detailed explanations on Org’s build system, please check the Org Build System page on Worg.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Naoya Yamashita</p>
<p class="date">Created: 2018-07-13 Fri 03:35</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
